Repository: tomichec/esd-cs
Catalog: esd-*.po
Languages: cs

source: Learn surveillance-resistant technologies for instant messages, hard drive storage, online sharing, and more at <a href="https://directory.fsf.org/wiki/Collection:Privacy_pack"> the Free Software Directory's Privacy Pack</a> and <a href="https://prism-break.org">prism-break.org</a>.
cs: Naučte se o technologiích pro vzdorování špehování v "chatových" zprávách, datech uložených na pevných discích a sdílených online, a mohých dalších v <a href="https://directory.fsf.org/wiki/Collection:Privacy_pack"> softwarových balíčku pro soukromí ve složce pro svobodný software</a> and <a href="https://prism-break.org">prism-break.org</a>.

source: If you are using Windows, Mac OS or any other proprietary operating system, we recommend you switch to a free software operating system like GNU/Linux. This will make it much harder for attackers to enter your computer through hidden back doors. Check out the Free Software Foundation's <a href="http://www.gnu.org/distros/free-distros.html">endorsed versions of GNU/Linux.</a>
cs: Pokud používáte Windows, Mac OS nebo jiný proprietární operační system, doporučujeme vám přejít na svobodný operační systém jako je GNU/Linux. Toto ztíží útočníkům proniknutí do vašeho systému skrze skryté zadní vrátka. Podívejte se na seznam <a href="http://www.gnu.org/distros/free-distros.html">verzí GNU/Linux schválených.</a> Nadací pro svobodný software.

source: Optional: Add more email protection with Tor
cs: Volitelné: Chraňte svůj email ještě více pomocí Tor

source: <a href="https://www.torproject.org/about/overview.html.en">The Onion Router (Tor) network</a> wraps Internet communication in multiple layers of encryption and bounces it around the world several times. When used properly, Tor confuses surveillance field agents and the global surveillance apparatus alike. Using it simultaneously with GnuPG's encryption will give you the best results.
cs: <a href="https://www.torproject.org/about/overview.html.en">Síť The Onion Router (Tor)</a> schová vaši Internetovou komunikaci v několika vrstvách šifrování a několik krát ji přepošle kolem světa. Pokud je použita správně, Tor zmate špehy špionážních služeb a taky systémy globálního dozoru. Použití šifrování Tor a GnuPG vám poskytne nejlepší ochranu.

source: To have your email program send and receive email over Tor, install the <a href="https://addons.mozilla.org/en-us/thunderbird/addon/torbirdy/">Torbirdy plugin</a> the same way you installed Enigmail, by searching for it through Add-ons.
cs: Aby váš program posílal a přijímal emaily přes síť Toru, nainstalujte <a href="https://addons.mozilla.org/en-us/thunderbird/addon/torbirdy/">Torbirdy plugin</a> stejným způsobem jako jste nainstalovali Enigmail, pomocí vyhledávání v Doplňcích.

source: Before beginning to check your email over Tor, make sure you understand <a href="https://www.torproject.org/docs/faq.html.en#WhatProtectionsDoesTorProvide">the security tradeoffs involved</a>. This <a href="https://www.eff.org/pages/tor-and-https">infographic</a> from our friends at the Electronic Frontier Foundation demonstrates how Tor keeps you secure.
cs: Předtím než budete stahovat váš email přes Tor, musíte porozumět <a href="https://www.torproject.org/docs/faq.html.en#WhatProtectionsDoesTorProvide">bezpečnostní důsledky</a>. Tento <a href="https://www.eff.org/pages/tor-and-https">informační leták</a> od našich známých z Electronic Frontier Foundation vám ukáže jak vás Tor udrží v bezpečí.

source: Section 6: Next Steps
cs: Sekce 6: Další kroky

source: &larr; <a href="index.html">Return to the guide</a>
cs: &larr; <a href="index.html">Zpět na příručku</a>

source: Make Email Self-Defense tools even better
cs: Vylepšete nástroje pro emailovou sebeobranu ještě více

source: <a href="https://libreplanet.org/wiki/GPG_guide/Public_Review">Leave feedback and suggest improvements to this guide</a>. We welcome translations, but we ask that you contact us at <a href="mailto:campaigns@fsf.org">campaigns@fsf.org</a> before you start, so that we can connect you with other translators working in your language.
cs: <a href="https://libreplanet.org/wiki/GPG_guide/Public_Review">Dejte nám zpětnou vazbu a návrhy pro vylepšení této příručky</a>. Přijímáme překlady, ale dříve než začnete, prosím kontaktujte nás na <a href="mailto:campaigns@fsf.org">campaigns@fsf.org</a>, abychom vás mohli spojit s dalšími lidmi, kteří pracujou na překladu do vašeho jazyka.

source: If you like programming, you can contribute code to <a href="https://www.gnupg.org/">GnuPG</a> or <a href="https://www.enigmail.net/home/index.php">Enigmail</a>.
cs: Pokud rádi programujete, můžete přispět ke kódování <a href="https://www.gnupg.org/">GnuPG</a> nebo <a href="https://www.enigmail.net/home/index.php">Enigmailu</a>.

source: To go the extra mile, support the Free Software Foundation so we can keep improving Email Self-Defense, and make more tools like it.
cs: Chcete-li poskytnout něco navíc, potpořte Nadaci pro svobodný software, čímž nám umožníte vylepšit emailovou sebeobranu, a mnohé další podobné nástroje.

source: <a href="windows.html" class="current">Windows</a>
cs: <a href="index.html" class="current">GNU/Linux</a>

source: This guide relies on software which is <a href="https://www.gnu.org/philosophy/free-sw.html">freely licensed</a>; it's completely transparent and anyone can copy it or make their own version. This makes it safer from surveillance than proprietary software (like Windows). To defend your freedom as well as protect yourself from surveillance, we recommend you switch to a free software operating system like GNU/Linux. Learn more about free software at <a href="https://u.fsf.org/ys">fsf.org</a>.
cs: Tato příručka je založena na software, který je poskytován <a href="https://www.gnu.org/philosophy/free-sw.html">pod svobodnou licencí</a>; práce těchto programů je naprosto transparentní a kdokoli může obdržet kopii, nebo vytvořit svou vlastní verzi. Toto zaručuje větší bezpečnost proti špehování než nesvobodný software (jako například Windows). O svobodném software se můžete dozvědět více na stránce <a href="https://u.fsf.org/ys">fsf.org</a>.

source: <em>Step 1.b</em> Get GnuPG by downloading GPG4Win
cs: <em>Krok 1.b</em> Stáhněte si GnuPG s programem GPG4Win

source: GPG4Win is a software package that includes GnuPG. <a href="http://files.gpg4win.org/gpg4win-2.2.1.exe">Download</a> and install it, choosing default options whenever asked. After it's installed, you can close any windows that it creates.
cs: GPG4Win je balíček software který zahrnuje GnuPG. <a href="http://files.gpg4win.org/gpg4win-2.2.1.exe">Stáhněte</a> a nainstalujte ho. Ponechte základním nastavením u všech položek. Poté, co jste ho nainstalovali, můžete zavřít všechna okna, která byla otevřena.

source: Email Self-Defense - Teach your friends!
cs: Emailová sebeobrana -- Vzdělejte své známé!

source: <a href="workshops.html" class="current">Teach your friends</a>
cs: <a href="workshops.html" class="current">Vzdělejte své známé!</a>

source: We want to translate this guide into more languages, and make a version for encryption on mobile devices. Please donate, and help people around the world take the first step towards protecting their privacy with free software.
cs: Rádi bychom přeložili tuto příručku do co nejvíce jazyků a vydali verzi pro šifrování na mobilních zařízeních. Prosíme přispějte a pomozte dalším lidem kolem světa udělat první krok pro ochranu jejich soukromí za pomocí svobodného software.

source: View &amp; share our infographic →
cs: Prohlédněte si a sdílejte náš informační leták →

source: </a> Understanding and setting up email encryption sounds like a daunting task to many people. That's why helping your friends with GnuPG plays such an important role in helping spread encryption. Even if only one person shows up, that's still one more person using encryption who wasn't before. You have the power to help your friends keep their digital love letters private, and teach them about the importance of free software. If you use GnuPG to send and receive encrypted email, you're a perfect candidate for leading a workshop!
cs: </a> Pochopení a nastavení emailového šifrování je pro mnohé náročný úkol. Proto pomoc vašim známým s GnuPG hraje tak významnou roli pro rozšíření šifrování. I kdyby na workshop přišla pouze jedna osoba, je to stále jedna osoba navíc požívající šifrování, která nebyla dříve. Máte možnost pomoct vašim přátelům udržet jejich digitální milostné dopisy soukromé, a naučit je o důležitosti svobodného software. Pokud sami používáte GnuPG pro posílání a přijímání šifrovaných emailů, jste skvělý kandidát pro vedení workshopu!

source: A small workshop among friends
cs: Malý workshop mezi přáteli

source: <em>#1</em> Get your friends or community interested
cs: <em>#1</em> Získejte zájem vašich přátel a známých

source: If you hear friends grumbling about their lack of privacy, ask them if they're interested in attending a workshop on Email Self-Defense. If your friends don't grumble about privacy, they may need some convincing. You might even hear the classic "if you've got nothing to hide, you've got nothing to fear" argument against using encryption.
cs: Pokud si vaši známí stěžují na nedostatek soukromí, zeptejte se jestli by měli zájem navštívit workshop na emailovou sebeobranu. Pokud se vaši známí o své soukromí neobávají, budete potřeba je přesvědčit. Možná uslyšíte klasický argument proti použití šifrování: "pokud nemáš co skrývat, nemusíš mít strach."

source: Here are some talking points you can use to help explain why it's worth it to learn GnuPG. Mix and match whichever you think will make sense to your community:
cs: Tady je několik stanovisek, které vám mohou pomoci vysvětlit, proč má smysl naučit se GnuPG. Vyberte ty, o kterých si myslíte, že jsou smysluplné pro vaši komunitu:

source: Strength in numbers
cs: V množství je síla

source: Each person who chooses to resist mass surveillance with encryption makes it easier for others to resist as well. People normalizing the use of strong encryption has multiple powerful effects: it means those who need privacy the most, like potential whistle-blowers and activists, are more likely to learn about encryption. More people using encryption for more things also makes it harder for surveillance systems to single out those that can't afford to be found, and shows solidarity with those people.
cs: Každá osoba která se rozhodne vzdorovat masovému špehování pomocí šifrování ulehčuje ostatním vzorovat také. Když se využití emailového šifrování stane normální, bude to mít významné důsledky: lidé, kteří potřebujou soukromí nejvíce, jako potencionální oznamovatelé trestných činů, whitstlebloweři a aktivisti, se seznámí s šifrováním s mnohem větší pravděpodobností. Čím více lidí, používá v více případech šifrování, tím složitější to je pro špionážní systemy vyčlenit ty, kteří si nemohou dovolit být odhaleni. Použití šifrování ukazuje solidaritu s těmito lidmi.

source: People you respect may already be using encryption
cs: Lidé, které respektujete již možná používají šifrování

source: Many journalists, whistleblowers, activists, and researchers use GnuPG, so your friends might unknowingly have heard of a few people who use it already. You can search for "BEGIN PUBLIC KEY BLOCK" + keyword to help make a list of people and organizations who use GnuPG whom your community will likely recognize.
cs: Spousta novinářů, whistlebolwerů, aktivistů a výzkumníků používá GnuPG, tak vaši známí možná slyšeli o několika lidech, kteří už GnuPG používají. Můžete si vyhledat "BEGIN PUBLIC KEY BLOCK" + klíčové slovo, což vám pomůže vytvořit seznam lidí a organizací, které používají GnuPG a které vaši známí pravděpodobně znájí.

source: Respect your friends' privacy
cs: Respektujte soukromí vašich známých

source: There's no objective way to judge what constitutes privacy-sensitive correspondence. As such, it's better not to presume that just because you find an email you sent to a friend innocuous, your friend (or a surveillance agent, for that matter!) feels the same way. Show your friends respect by encrypting your correspondence with them.
cs: Neexistuje objektivní způsob, jak rozhodnout, co zahrnuje citlivou soukromou korespondenci. Proto, i když si můžete myslet, že email, který posíláte je neškodný, je lepší nepředpokládat, že to samé si bude myslet i váš známý (nebo špión, či počítačový kriminálník, který se k emailu dostane). Projevte vašim známým respekt tím, že korespondenci s nimi zašifrujete.

source: Privacy technology is normal in the physical world
cs: Předměty pro ochranu soukromí jsou běžné ve fyzickém světě

source: In the physical realm, we take window blinds, envelopes, and closed doors for granted as ways of protecting our privacy. Why should the digital realm be any different?
cs: Ve fyzickém světě považujeme závěsy na oknech, obálky na dopisech a zavřené dveře za běžný způsob ochrany našeho soukromí. Proč by to mělo být jiné v digitální sféře?

source: We shouldn't have to trust our email providers with our privacy
cs: Neměli bychom důvěřovat, že poskytovatelé našich emailových účtů dokáží ochránít naše soukromí

source: Some email providers are very trustworthy, but many have incentives not to protect your privacy and security. To be empowered digital citizens, we need to build our own security from the bottom up.
cs: Někteří poskytovatelé emalilů jsou velmi důvěryhodní, ale mnoho z nich těží z toho, že naše soukromí a bezpečnost nechrání. Abychom se stali schopnými občany silné digitální společnosti, musíme budovat naši vlastní bezpečnost od základů.

source: <em>#2</em> Plan The Workshop
cs: <em>#2</em> Naplánujte workshop

source: Once you've got at least one interested friend, pick a date and start planning out the workshop. Tell participants to bring their computer and ID (for signing each other's keys). If you'd like to make it easy for the participants to use Diceware for choosing passwords, get a pack of dice beforehand. Make sure the location you select has an easily accessible Internet connection, and make backup plans in case the connection stops working on the day of the workshop. Libraries, coffee shops, and community centers make great locations. Try to get all the participants to set up an Enigmail-compatible email client before the event. Direct them to their email provider's IT department or help page if they run into errors.
cs: Jakmile budete mít alespoň jednoho zájemce o workshop, vyberte datum a začněte plánovat workshop. Řekněte účastníkům, aby si přinesli své vlastní počítače a úřední doklad (pro ověření údajů při vzájemném podpisování klíčů). Pokud chcete účastníkům ulehčit použití metody Diceware pro výběr hesel, připravte si balíček kostek. Ověřte, že místo, které jste vybrali ma snadno dostupné internetové připojení, ale mějte záložní plán pokud internet přestane fungovat v den workshopu. Knihovny, kavárny a komunitní centra jsou výborné místa, ze kterých můžete vybírat. Řekněte všem účastníkům, aby si zkusili nastavit emailový program kompatibilní s Enigmailem před workshopem. Odkažte je na podporu poskytovatele jejich emailového účtu nebo nápovědu v případě, že narazí na chyby.

source: Estimate that the workshop will take at least forty minutes plus ten minutes for each participant. Plan extra time for questions and technical glitches.
cs: Odhadovaná délka workshopu je nejméně čtyřicet minut, za každého účastníka navíc připočtěte deset minut. Vyhraďte také nějaký čas také na otázky a pro případ technických závad.

source: The success of the workshop requires understanding and catering to the unique backgrounds and needs of each group of participants. Workshops should stay small, so that each participant receives more individualized instruction. If more than a handful of people want to participate, keep the facilitator to participant ratio high by recruiting more facilitators, or by facilitating multiple workshops. Small workshops among friends work great!
cs: Úspěch vašeho workshopu vyžaduje porozumnění a přispůsobení se různé míře znalostí a potřeb každé skupiny účastníků. Workshopy by měly být malé, aby každý z účastníků obdržel dostatek individualizovaných pokynů. Pokud se chce zúčastnit více než malá skupina lidí sežeňte více instruktorů nebo zorganizujte více workshopů, abyste udželi vysoký podíl instruktorů na účastníky. Malé workshopy mezi přáteli fungují dobře.

source: <em>#3</em> Follow the guide as a group
cs: <em>#3</em> Postupujte podle příručky s celou skupinou

source: Work through the Email Self-Defense guide a step at a time as a group. Talk about the steps in detail, but make sure not to overload the participants with minutia. Pitch the bulk of your instructions to the least tech-savvy participants. Make sure all the participants complete each step before the group moves on to the next one. Consider facilitating secondary workshops afterwards for people that had trouble grasping the concepts, or those that grasped them quickly and want to learn more.
cs: Projděte příručkou emailové sebeobrany krok za krokem společně s celou skupinou. Podrobně vysvětlete všechny kroky, ale na druhou stranu nepřetěžujte účastníky nepodstatnými detaily. Nalaďte složitost svých pokynů pro technicky nejméně zdatné účastníky. Ověřte, že všichni účastníci dokončili každý krok, před tím, než skupina postoupí k dalšímu kroku. Zvažte, jestli byste měli vést pozdější workshop pro lidi, kteří mají potíže porozumět pomům, nebo pro ty, kteří jim porozumí rychle a rádi by se dozvěděli více.

source: In <a href="index.html#section2">Section 2</a> of the guide, make sure the participants upload their keys to the same keyserver so that they can immediately download each other's keys later (sometimes there is a delay in synchronization between keyservers). During <a href="index.html#section3">Section 3</a>, give the participants the option to send test messages to each other instead of or as well as Edward. Similarly, in <a href="index.html#section4">Section 4</a>, encourage the participants to sign each other's keys. At the end, make sure to remind people to safely back up their revocation certificates.
cs: V <a href="index.html#section2">Sekci 2</a> této příručky, ověřte, že účastníci nahrají bezodkladně svůj klíč na keyserver, aby mohli později stáhnout klíče ostatních (občas synchronizace mezi keyservery chvíli trvá). Během <a href="index.html#section3">Sekce 3</a>, jim dejte možnost poslat si testovací zprávu mezi sebou, namísto nebo navíc ke zprávě pro Edwarda. Stejně, v <a href="index.html#section4">Sekci 4</a>, povzbuďte účastníky, aby vzájemně podepsali své klíče. Nakonec jim připomeňte, aby bezpečně zálohovali své revokační certifikáty.

source: <em>#4</em> Explain the pitfalls
cs: <em>#4</em> Vysvětlete nástrahy

source: Remind participants that encryption works only when it's explicitly used; they won't be able to send an encrypted email to someone who hasn't already set up encryption. Also remind participants to double-check the encryption icon before hitting send, and that subjects and timestamps are never encrypted.
cs: Připomeňte účastníkům, že šifrování funguje jen pokud je výslovně použité; není možné poslat šifrovaný email někomu, kdo si jestě nenastavil šifrovací klíče. Také připomeňte, aby před odesláním zprávy znova zkontrolovali, že je šifrování zapnuto, a že předmět zprávy a časové razítka nejsou nikdy šifrovány.

source: Explain the <a href="https://www.gnu.org/proprietary/proprietary.html">dangers of running a proprietary system</a> and advocate for free software, because without it, we can't <a href="https://www.fsf.org/bulletin/2013/fall/how-can-free-software-protect-us-from-surveillance">meaningfully resist invasions of our digital privacy and autonomy</a>.
cs: Vysvětlete <a href="https://www.gnu.org/proprietary/proprietary.html">nebezpečí používání proprietarního systému</a> a vybídněte je k používání svobodného software, protože bez toho nemůžeme <a href="https://www.fsf.org/bulletin/2013/fall/how-can-free-software-protect-us-from-surveillance">smysluplně vzdorovat invazi našeho digitálního soukromí a autonomie</a>.

source: <em>#5</em> Share additional resources
cs: <em>#5</em> Sdílejte další zdroje informací

source: GnuPG's advanced options are far too complex to teach in a single workshop. If participants want to know more, point out the advanced subsections in the guide and consider organizing another workshop. You can also share <a href="https://www.gnupg.org/documentation/index.html">GnuPG's</a> and <a href="https://www.enigmail.net/documentation/index.php">Enigmail's</a> official documentation and mailing lists. Many GNU/Linux distribution's Web sites also contain a page explaining some of GnuPG's advanced features.
cs: Pokročilé možnosti GnuPG jsou příliš složité na to, aby je bylo možné vysvětlit během jednoho workshopu. Pokud účastníci chějí vědět více, odkažte je na sekce pro pokročilé v příručce a zvažte, zda uspořádat další workshop. Můžete také sdílet oficiální dokumentaci a emailové listy <a href="https://www.gnupg.org/documentation/index.html">GnuPG</a> a <a href="https://www.enigmail.net/documentation/index.php">Enigmailu</a>. Spousta webů GNU/Linux distribucí rovněž obsahuje stránky, které se zaobírají některými z pokročilých možností GnuPG.

source: <em>#6</em> Follow up
cs: <em>#6</em> Po skončení workshopu

source: Make sure everyone has shared email addresses and public key fingerprints before they leave. Encourage the participants to continue to gain GnuPG experience by emailing each other. Send them each an encrypted email one week after the event, reminding them to try adding their public key ID to places where they publicly list their email address.
cs: Ověřte, že před odchodem všichni sdíleli emailovou adresu a veřejný klíč s digitálním otiskem. Povzbuďte je, aby získali další zkušenosti s GnuPG, při vzájemném dopisování. Pošlete jim šifrovaný email týden po workshopu a připomeňte jim aby přidali svůj veřejný klíč na místech, kde zpřístupňují svou emailovou adresu.

source: If you have any suggestions for improving this workshop guide, please let us know at <a href="mailto:campaigns@fsf.org">campaigns@fsf.org</a>.
cs: Pokud máte připomínky nebo návrhy, jak vylepšit tuto příručku k workshopu, prosíme dejte nám věďet na <a href=\"mailto:campaigns@fsf.org\">campaigns@fsf.org</a>
