Repository: tomichec/esd-cs
Catalog: esd-*.po
Languages: cs

source: People who use your public key can see who has signed it. Once you've used GnuPG for a long time, your key may have hundreds of signatures. You can consider a key to be more trustworthy if it has many signatures from people that you trust. The Web of Trust is a constellation of GnuPG users, connected to each other by chains of trust expressed through signatures.
cs: Lidé, kteří používají veřejné klíče mohou vidět, kdo je podepsal. Až budete používat GnuPG dlouhou dobu, váš klíč může mít stovky podpisů. Klíč se stává důvěryhodnější, pokud má mnoho podpisů od lidí, které znáte. Síť důvěry je uskupení uživatelů GnuPG, spojených dohromady pomocí řetězce důvěry, kterou vyjádřili pomocí svých podpisů.

source: Section 4: Web of Trust
cs: Sekce 4: Síť důvěry

source: <em>Step 4.a</em> Sign a key
cs: <em>Krok 4.a</em> Podepište klíč

source: In your email program's menu, go to Enigmail &rarr; Key Management.
cs: Ve menu vašeho emailového programu jděte na Enigmail &rarr; Správa klíčů.

source: Right click on Edward's public key and select Sign Key from the context menu.
cs: Klikněte pravým tlačítkem na Edwardův veřejný klíč a vyberte Podepsat Klíč z nabídky.

source: In the window that pops up, select "I will not answer" and click ok.
cs: V okně které se objeví zvolte "Neodpovím" a klikněte na ok.

source: Now you should be back at the Key Management menu. Select Keyserver &rarr; Upload Public Keys and hit ok.
cs: Nyní byste měli být zpět na menu Správa klíčů. Zvolte Keyserver &rarr; Nahrát klíč a klikněte na ok.

source: You've just effectively said "I trust that Edward's public key actually belongs to Edward." This doesn't mean much because Edward isn't a real person, but it's good practice.
cs: Nyní jste zveřejnili "Důvěřuju, že Edwardův veřejný klíč skutečně patří Edwardovi." Edward není skutečná osoba, a proto to moc neznamená, ale je správné podepsat klíče ostatních lidí, které znáte.

source: Identifying keys: Fingerprints and IDs
cs: Identifikace klíčů: Otisk a ID

source: People's public keys are usually identified by their key fingerprint, which is a string of digits like F357AA1A5B1FA42CFD9FE52A9FF2194CC09A61E8 (for Edward's key). You can see the fingerprint for your public key, and other public keys saved on your computer, by going to Enigmail &rarr; Key Management in your email program's menu, then right clicking on the key and choosing Key Properties. It's good practice to share your fingerprint wherever you share your email address, so that people can double-check that they have the correct public key when they download yours from a keyserver.
cs: Veřejné klíče ostatních jsou běžně identifikovatelné pomocí jejich otisku, což je řetězec znaků jako F357AA1A5B1FA42CFD9FE52A9FF2194CC09A61E8 (pro Edwardův klíč). Otisk svého klíče můžete zjistit v nabídce Enigmail &rarr; Správa klíčů ve vašem emailovém programu, poté klikněte pravým tlačítkem a zvolte Vlastnosti klíče. Je správné předat váš otisk vždy, když někomu dáváte vaši adresu, takže lidé mohou důkladně ověřit, že si z keyserveru stáhli váš správný veřejný klíč.

source: You may also see public keys referred to by their key ID, which is simply the last eight digits of the fingerprint, like C09A61E8 for Edward. The key ID is visible directly from the Key Management window. This key ID is like a person's first name (it is a useful shorthand but may not be unique to a given key), whereas the fingerprint actually identifies the key uniquely without the possibility of confusion. If you only have the key ID, you can still look up the key (as well as its fingerprint), like you did in Step 3, but if multiple options appear, you'll need the fingerprint of the person to whom you are trying to communicate to verify which one to use.
cs: Také je možné se setkat s odkazy na veřejný klíč pomocí ID klíče, což je jednoduše posledních osm čísel podpisu, jako například C09A61E8 pro Edwarda. ID klíče je vidět přímo v okně Správy klíčů. Toto ID klíče se dá přirovnat ke jménu osoby (což je užitečná zkratka, ale nemusí být vždy jedinečná), zatímco otisk skutečně určuje daný klíč jedinečně bez nebezpečí záměny. Pokud máte jen ID, můžete si klíč vyhledat (stejně jako jeho otisk), jako jste provedli v <a href="#section3">Kroku 3</a>, ale obdržíte-li více výsledků vyhledávání je potřeba, aby vám osoba, se kterou se snažíte spojit, poskytla svůj otisk, ze kterého určíte, který klíč použít.

source: <em>Important:</em> What to consider when signing keys
cs: <em>Důležité:</em> Co mít na vědomí při podpisování klíčů

source: Before signing a person's key, you need to be confident that it actually belongs to them, and that they are who they say they are. Ideally, this confidence comes from having interactions and conversations with them over time, and witnessing interactions between them and others. Whenever signing a key, ask to see the full public key fingerprint, and not just the shorter key ID. If you feel it's important to sign the key of someone you've just met, also ask them to show you their government identification, and make sure the name on the ID matches the name on the public key. In Enigmail, answer honestly in the window that pops up and asks "How carefully have you verified that the key you are about to sign actually belongs to the person(s) named above?"
cs: Předtím, než podepíšete něčí klíč, musíte být přesvědčeni, že tento klíč skutečně patří této osobě a že je tato osoba tou, za kterou se vydává. V ideálním případě toto přesvědčení pramení z toho, že jste si s touto osobou nějakou dobu komunikovali a že jste byli svědky její interakce s ostatními. Kdykoli podepisujete klíč, zeptejte se jestli můžete vidět celý otisk jejího veřejného klíče, a ne pouze krátké ID. Pokud si myslíte, že je třeba podepsat klíč od někoho, koho jste právě potkali, zeptejte se také, jestli můžete vidět jejich úřední dokument, a ověřte, že se jméno na tomto dokumentu, shoduje, s tím na veřejném klíči. V Enigmail, odpovězte upřímně na otázkou "Jak důkladně jste ověřili, že klíč, který podepisujete skutečně patří osobě, pod jejímž je jménem?" v okně které se objeví.

source: Master the Web of Trust
cs: Porozuměte the síťi důvěry

source: Unfortunately, trust does not spread between users the way <a href="http://fennetic.net/irc/finney.org/~hal/web_of_trust.html">many people think</a>. One of best ways to strengthen the GnuPG community is to deeply <a href="https://www.gnupg.org/gph/en/manual/x334.html">understand</a> the Web of Trust and to carefully sign as many people's keys as circumstances permit.
cs: Bohužel, síť důvěry se nerozšířila mezi uživateli způsobem <a href="http://fennetic.net/irc/finney.org/~hal/web_of_trust.html">jak si mnozí mysleli</a>. Jedna z nejlepších cest jak posílit komunitu GnuPG je dobře <a href="https://www.gnupg.org/gph/en/manual/x334.html">pochopit</a> síť důvěry a precizně podepsat klíče od tolika lidí, od kolika je to možné.

source: Set ownertrust
cs: Nastavte důvěryhodnost majitele

source: If you trust someone enough to validate other people's keys, you can assign them an ownertrust level through Enigmails's key management window. Right click on the other person's key, go to the "Select Owner Trust" menu option, select the trustlevel and click OK. Only do this once you feel you have a deep understanding of the Web of Trust.
cs: Pokud někomu důvěřujete, že je schopný ověřovat klíče dalších lidí, můžete pro jeho klíč nastavit míru důvěrohodnosti majitele přes Správu klíčů v okně Enigmail. Klikněte pravým tlačítkem na klíč této osoby a v menu jděte na položku Vybrat důvěryhodnost majitele, poté nastavte míru důvěryhodnosti a klikněte na ok. Tento úkon provádějte pouze pokud dobře rozumíte síti důvěry.

source: <em>#5</em> Use it well
cs: <em>#5</em> Správné použití

source: Everyone uses GnuPG a little differently, but it's important to follow some basic practices to keep your email secure. Not following them, you risk the privacy of the people you communicate with, as well as your own, and damage the Web of Trust.
cs: Každý používá GnuPG trochu odlišně, ale je důležité se řídit několika základními pravidly pro zajištění bezpečnosti vaších emailů. Pokud se jimi neřídíte riskujete soukromí lidí, se kterými komunikujete, stejně jako vaše vlastní, a poškozujete Síť důvěry.

source: Section 5: Use it Well (1)
cs: Sekce 5: Správné použití (1)

source: When should I encrypt? When should I sign?
cs: Kdy bych měl šifrovat? Kdy bych měl přidat podpis?

source: The more you can encrypt your messages, the better. If you only encrypt emails occasionally, each encrypted message could raise a red flag for surveillance systems. If all or most of your email is encrypted, people doing surveillance won't know where to start. That's not to say that only encrypting some of your email isn't helpful -- it's a great start and it makes bulk surveillance more difficult.
cs: Čím více zpráv budete šifrovat, tím lépe. Pokud budete šifrovat emaily pouze příležitostně, šifrované zprávy budou pro špionážní systémy podezřelé. Pokud budou šifrovány všechny vaše zprávy, lidé kteří se slídí po vašich datech nebudou vědět, kde začít. To ale neznamená, že šifrování pouze některých zpráv není užitečné -- je to dobrý začátek, který znesnadňuje masové špehování.

source: Unless you don't want to reveal your own identity (which requires other protective measures), there's no reason not to sign every message, whether or not you are encrypting. In addition to allowing those with GnuPG to verify that the message came from you, signing is a non-intrusive way to remind everyone that you use GnuPG and show support for secure communication. If you often send signed messages to people that aren't familiar with GnuPG, it's nice to also include a link to this guide in your standard email signature (the text kind, not the cryptographic kind).
cs: Pokud nechcete odhalit svou identitu (což ale vyžaduje další ochrané metody), není důvod nepodepsat každou zprávu bez ohledu na to, jestli je šifrovaná nebo ne. Krom toho, že lidé, kteří mají GnuPG mohou ověřit, že vaše zpráva skutečně přichází od vás, podpisování zpráv je nevnucující se metoda, jak každému připomenout, že používáte GnuPG a jak můžete ukázat, že podporujete bezpečnou komunikaci. Pokud budete posílat podepsané zprávy lidem kteří, nejsou seznámeni s GnuPG bude, často, dobré pokud také zmíníte odkaz na tuto příručku ve vašem emailovém podpisu (tom textovém, ne elektronickém).

source: Section 5: Use it Well (2)
cs: Sekce 5: Správné použití (2)

source: Be wary of invalid keys
cs: Buďte ostražití před neplatnými klíči

source: GnuPG makes email safer, but it's still important to watch out for invalid keys, which might have fallen into the wrong hands. Email encrypted with invalid keys might be readable by surveillance programs.
cs: GnuPG dělá email bezpečnějším, ale je stále důležité, abyste byli na pozoru před neplatnými klíči, které mohly padnout do špatných rukou. Email zašifrovaný s neplatným klíčem může být čitelný pro špionážní programy.

source: In your email program, go back to the first encrypted email that Edward sent you. Because Edward encrypted it with your public key, it will have a message from Enigmail at the top, which most likely says "Enigmail: Part of this message encrypted."
cs: Ve svém emailovém programu, najděte první šifrovaný email, který jste dostali of Edwarda. Protože Edward zašifroval email vašim veřejným klíčem, na horní liště pravděpodobně můžete vidět zprávu od Enigmail, která říká "Enigmail: Část této zprávy je šifrovaná."

source: <b>When using GnuPG, make a habit of glancing at that bar. The program will warn you there if you get an email encrypted with a key that can't be trusted.</b>
cs: <b>Když používáte GnuPG, zvykněte si vždy zběžně zkontrolovat tuto zprávu. Program vás bude varovat pokud dostanete zprávu zašifrovanou klíčem, kterému není možné důvěřovat.</b>

source: Copy your revocation certificate to somewhere safe
cs: Zálohujte váš revokační certifikát na bezpečné místo

source: Remember when you created your keys and saved the revocation certificate that GnuPG made? It's time to copy that certificate onto the safest digital storage that you have -- the ideal thing is a flash drive, disk, or hard drive stored in a safe place in your home, not on a device you carry with you regularly.
cs: Vzpomeňte si, že když jste vytvořili vaše klíče, taky jste uložili revokační certifikát, který pro vás GnuPG vytvořil? Nyní přichází chvíle, kdy je třeba zkopírovat tento certifikát na co nejbezpečnější datové uložiště, které máte -- nejlepší je flash disk, disk, nebo pevný disk, který necháte uložený na bezpečném místě doma a nebudete ho s sebou běžně nosit.

source: If your private key ever gets lost or stolen, you'll need this certificate file to let people know that you are no longer using that keypair.
cs: Pokud se váš soukromý klíč ztratí, nebo bude ukraden, budete potřebovat soubor s tímto certifikátem, aby ostatním dali navědomí, že už tento pár klíčů nepoužíváte.

source: <em>Important:</em> act swiftly if someone gets your private key
cs: <em>Důležité:</em> Jednejte rychle se někdo dostane k vašemu soukromému klíči

source: If you lose your private key or someone else gets ahold of it (say, by stealing or cracking your computer), it's important to revoke it immediately before someone else uses it to read your encrypted email or forge your signature. This guide doesn't cover how to revoke a key, but you can follow these <a href="https://www.hackdiary.com/2004/01/18/revoking-a-gpg-key/">instructions</a>. After you're done revoking, make a new key and send an email to everyone with whom you usually use your key to make sure they know, including a copy of your new key.
cs: Pokud ztratíte váš soukromý klíč, nebo se dostane do rukou někoho dalšího (řekněme, že ho ukrade nebo se nabourá do vašeho počítače), je potřeba co nejrychleji odvolat jeho platnost (revokovat). Tato příručka se nezabývá tím jak odvolat platnost klíče, ale můžete se řídit těmito <a href="https://www.hackdiary.com/2004/01/18/revoking-a-gpg-key/">instrukcemi</a>. Poté co jste klíč revokovali, vytvořte nový klíč a dejte vědět všem, s kým pravidelně používáte svůj klíč, že váš starý klíč je neplatný a rovněž přiložte váš nový klíč.

source: Webmail and GnuPG
cs: Webmail a GnuPG

source: When you use a web browser to access your email, you're using webmail, an email program stored on a distant website. Unlike webmail, your desktop email program runs on your own computer. Although webmail can't decrypt encrypted email, it will still display it in its encrypted form. If you primarily use webmail, you'll know to open your email client when you receive a scrambled email.
cs: Pokud používáte webový prohlížeč pro přístup k vašemu emailu, používáte webmail, emailový program uložený na vzdálené stránce. Narozdíl od webmailu, váš emailový program běží na vašem vlastním počítači. I když webmail nemůže rozluštit šifrované zprávy, stále je zobrazí v jejich šifrované podobě. Pokud používáte primárně webmail, budete vědět, že musíte otevřít váš emailový program, když obdržíte zašifrovanou zprávu.

source: <a href="next_steps.html">Great job! Check out the next steps.</a>
cs: <a href="next_steps.html">Dobrá práce! Podívejte se na další kroky.</a>

source: &larr; Read the <a href="index.html">full guide</a>
cs: &larr; Přečtěte si <a href="index.html">celou příručku</a>

source: &nbsp; Share our infographic </a> with the hashtag #EmailSelfDefense
cs: &nbsp; Sdílejte náš informační leták </a> s hashtagem #EmailSelfDefense

source: View &amp; share our infographic
cs: Prohlédněte si a sdílejte náš informační leták

source: <a href="index.html">GNU/Linux</a>
cs: <a href="index.html" class="current">GNU/Linux</a>

source: <a href="mac.html" class="current">Mac OS</a>
cs: <a href="mac.html">Mac OS</a>

source: This guide relies on software which is <a href="https://www.gnu.org/philosophy/free-sw.html">freely licensed</a>; it's completely transparent and anyone can copy it or make their own version. This makes it safer from surveillance than proprietary software (like Mac OS). To defend your freedom as well as protect yourself from surveillance, we recommend you switch to a free software operating system like GNU/Linux. Learn more about free software at <a href="https://u.fsf.org/ys">fsf.org</a>.
cs: Tato příručka je založena na software, který je poskytován <a href="https://www.gnu.org/philosophy/free-sw.html">pod svobodnou licencí</a>; práce těchto programů je naprosto transparentní a kdokoli může obdržet kopii, nebo vytvořit svou vlastní verzi. Toto zaručuje větší bezpečnost proti špehování než nesvobodný software (jako například Windows). O svobodném software se můžete dozvědět více na stránce <a href="https://u.fsf.org/ys">fsf.org</a>.

source: To get started, you'll need the IceDove desktop email program installed on your computer. For your system, IceDove may be known by the alternate name "Thunderbird." Email programs are another way to access the same email accounts you can access in a browser (like Gmail), but provide extra features.
cs: Většina operačních systémů GNU/Linux má GnuPG již připraven k použití, takže jej není potřeba stahovat. Předtím, než nastavíte GnuPG, musíte na váš počítač nainstalovat emailový program IceDove. Většína distribucí GNU/Linux má IceDove již nainstalován, ačkoli může být pod alternativním názvem "Thunderbird." Emailové programy jsou jiný způsob pro přihlášení na stejný emailovému účtu, ke kterému se můžete připojovat přes prohlížeč (např. Gmail), ale poskytují další funkce.

source: You can launch the wizard yourself, but the menu option for doing so is named differently in each email programs. The button to launch it will be in the program's main menu, under "New" or something similar, titled something like "Add account" or "New/Existing email account."
cs: Můžete spustit průvodce sami, ale položka v menu se jmenuje jinak v každém emailovém programu. Tlačítko pro spuštění je v hlavním menu programu, pod položkou "Nový" nebo nějakou podobnou, nazvaný něčím podobným jako "Přidat účet" nebo "Nový/Existující emailový účet."

source: <em>Step 1.b</em> Get GnuPG by downloading GPGTools
cs: <em>Krok 1.b</em> Stáhněte si GnuPG s programem GPGTools

source: GPGTools is a software package that includes GnuPG. <a href="https://gpgtools.org/#gpgsuite">Download</a> and install it, choosing default options whenever asked. After it's installed, you can close any windows that it creates.
cs: GPGTools je balíček software, který obsahuje GnuPG. <a href="https://gpgtools.org/#gpgsuite">Stáhněte</a> a nainstalujte ho. Ponechte základním nastavením u všech položek. Poté, co jste ho nainstalovali, můžete zavřít všechna okna, která byla otevřena.

source: Step 1.C: Tools -> Add-ons
cs: Krok 1.C: Nástroje -> Doplňky

source: Step 1.C: Search Add-ons
cs: Krok 1.C: Vyhledejte Doplňky

source: Step 1.C: Install Add-ons
cs: Krok 1.A: Průvodce nastavením

source: <em>Step 1.c</em> Install the Enigmail plugin for your email program
cs: <em>Krok 1.b</em>Nainstalujte Enigmail plugin pro svůj emailový program

source: In your email program's menu, select Add-ons (it may be in the Tools section). Make sure Extensions is selected on the left. Do you see Enigmail? if so, skip this step.
cs: V menu vašeho emailového programu, vyberte Add-ons (pravděpodobně se nachází v sekci Nástroje). Ověřte, že nalevo jsou vybrané Extensions. Používáte Enigmail? Pokud ano, přeskočte tento krok.

source: Great job!
cs: Dobrá práce

source: <em>#6</em> Next steps
cs: <em>#6</em> Další postup

source: You've now completed the basics of email encryption with GnuPG, taking action against bulk surveillance. These next steps will help make the most of the work you've done.
cs: Nyní jste dokončili základy emailového šifrování s GnuPG, čímž jste přijali opatření proti masovému špehování. Tyto další kroky vám pomůžou co nejvíce využít vaši vynaloženou práci.

source: Join the movement
cs: Připojte se k našemu hnutí

source: You've just taken a huge step towards protecting your privacy online. But each of us acting alone isn't enough. To topple bulk surveillance, we need to build a movement for the autonomy and freedom of all computer users. Join the Free Software Foundation's community to meet like-minded people and work together for change.
cs: Právě jste udělali obrovský krok pro ochranu vašeho on-line soukromí. Ale nestačí, když každý z nás jedná, samostatně. K svrhnutí hormadného špehování musíme vybudovat hnutí za autonomii a svobodu všech uživatelů počítačů. Připojte se ke komunitě Nadace pro Svobodný software, seznamte se s podobně smýšlejícími lidmi a pracujte s námi na změně.

source: <small>Read <a href="https://www.fsf.org/twitter">why GNU Social and Pump.io are better than Twitter</a>, and <a href="http://www.fsf.org/facebook">why we don't use Facebook</a>.</small>
cs: <small>Přečtěte si <a href="https://www.fsf.org/twitter">proč je GNU Social a Pump.io lepší než Twitter</a>, a <a href="http://www.fsf.org/facebook">proč nepoužíváme Facebook</a>.</small>

source: Low-volume mailing list
cs: Emailový občasník

source: <small>Read our <a href="https://my.fsf.org/donate/privacypolicy.html">privacy policy</a>.</small>
cs: <small>Přečtěte si <a href="https://my.fsf.org/donate/privacypolicy.html">pravidla ochrany soukromí</a>.</small>

source: Bring Email Self-Defense to new people
cs: Přineste emailovou sebeobranu dalším lidem.

source: Understanding and setting up email encryption is a daunting task for many. To welcome them, make it easy to find your public key and offer to help with encryption. Here are some suggestions:
cs: Pochopení a nastavení emailového šifrování je pro mnohé náročný úkol. Abychom je přivítali, usnadněte jim najít váš veřejný klíč a nabídněte jim pomoc se šifrováním. Zde je několik návrhů:

source: Lead an Email Self-Defense workshop for your friends and community, using our <a href="workshops.html">teaching guide</a>.
cs: Veďte workshop emailové sebeobrany pro své přátele a známé, použijte naši <a href="workshops.html">učebnici</a>.

source: Use <a href="https://fsf.org/share?u=https://u.fsf.org/zb&amp;t=Encrypt with me using Email Self-Defense %40fsf">our sharing page</a> to compose a message to a few friends and ask them to join you in using encrypted email. Remember to include your GnuPG public key fingerprint so they can easily download your key.
cs: Použijte <a href="https://fsf.org/share?u=https://u.fsf.org/zb&amp;t=Encrypt with me using Email Self-Defense %40fsf">naši stránku pro sdílení</a> pro napsání zprávy několika přátelům a vyzvěte je, aby se k vám přidali v používání šifrovaného emailu. Nezapomeňte přiložit digitální otisk vášeho veřejného klíče GnuPG aby si mohli jednoduše stáhnout váš klíč.

source: Add your public key fingerprint anywhere that you normally display your email address. Some good places are: your email signature (the text kind, not the cryptographic kind), social media profiles, blogs, Websites, or business cards. At the Free Software Foundation, we put ours on our <a href="https://fsf.org/about/staff">staff page</a>.
cs: Připojte váš digitální otisk vašeho veřejného klíče všude, kde běžně zobrazujete vaši emailovou adresu. Některé z vhodných míst jsou: váš emailový podpis (ten textový, ne elektronický), profil na sociálních médiích, blog, webové stráky, nebo vizitka. V Nadaci pro svobodný sofware, vkládáme svůj na naši <a href="https://fsf.org/about/staff">zaměstnaneckou stránku</a>.

source: Protect more of your digital life
cs: Chraňte více svůj digitální život
