Repository: tomichec/esd-cs
Catalog: esd-*.po
Languages: cs

source: Email Self-Defense - a guide to fighting surveillance with GnuPG encryption
cs: Emailová sebeobrana - příručka pro boj proti špehování s GnuPG šifrováním

source: <strong>Please check your email for a confirmation link now. Thanks for joining our list!</strong>
cs: <strong>Prosíme zkontrolujte váš email, na který byste nyní měli obdržet odkaz pro potvrzení. Děkujeme vám za připojení se k našemu emailovému listu.</strong>

source: If you don't receive the confirmation link, send us an email at info@fsf.org to be added manually.
cs: Pokud neobdržíte odkaz pro potvrzení, pošlete nám email na <a href="mailto:info@fsf.org">info@fsf.org</a> abychom vás mohli přidat manuálně.

source: Try it out.
cs: Vyzkoušejte to.

source: Join us on microblogging services for day-to-day updates:
cs: Připojte se k nám na mikro-blogovacích sítích pro denní zprávy:

source: <small><a href="https://www.fsf.org/twitter">Read why GNU Social and Pump.io are better than Twitter.</a></small>
cs: <small>Přečtěte si <a href="https://www.fsf.org/twitter">proč je GNU Social a Pump.io lepší než Twitter.</a></small>

source: &larr; Return to <a href="index.html">Email Self-Defense</a>
cs: &larr; Zpět na <a href="index.html">emailovou sebeobranu</a>

source: Free Software Foundation
cs: Nadace pro svobodný software

source: Copyright &copy; 2014-2016 <a href="https://u.fsf.org/ys">Free Software Foundation</a>, Inc. <a href="https://my.fsf.org/donate/privacypolicy.html">Privacy Policy</a>. Please support our work by <a href="https://u.fsf.org/yr">joining us as an associate member.</a>
cs: Copyright &copy; 2014-2016 <a href="https://u.fsf.org/ys">Free Software Foundation</a>, Inc. <a href="https://my.fsf.org/donate/privacypolicy.html">ochrana osobních údajů</a>. Prosíme podpořte naši práci, <a href="https://u.fsf.org/yr">přihlašte se ke členství.</a>

source: The images on this page are under a <a href="https://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 license (or later version)</a>, and the rest of it is under a <a href="https://creativecommons.org/licenses/by-sa/4.0">Creative Commons Attribution-ShareAlike 4.0 license (or later version)</a>. Download the <a href="http://agpl.fsf.org/emailselfdefense.fsf.org/edward/CURRENT/edward.tar.gz">source code of Edward reply bot</a> by Andrew Engelbrecht &lt;sudoman@ninthfloor.org&gt; and Josh Drake &lt;zamnedix@gnu.org&gt;, available under the GNU Affero General Public License. <a href="http://www.gnu.org/licenses/license-list.html#OtherLicenses">Why these licenses?</a>
cs: Obrázky na této stránce jsou pod a <a href="https://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 license (or later version)</a>, zbytek obsahu je pod <a href="https://creativecommons.org/licenses/by-sa/4.0">Creative Commons Attribution-ShareAlike 4.0 license (or later version)</a>. Stáhněte si <a href="http://agpl.fsf.org/emailselfdefense.fsf.org/edward/CURRENT/edward.tar.gz">zdrojový kód chatovacího bota Edwarda</a> by Andrew Engelbrecht &lt;sudoman@ninthfloor.org&gt; and Josh Draka &lt;zamnedix@gnu.org&gt;, zpřístupněného pod podmínkami GNU Affero General Public License. <a href="http://www.gnu.org/licenses/license-list.html#OtherLicenses">Proč tyto license?</a>

source: Fonts used in the guide &amp; infographic: <a href="https://www.google.com/fonts/specimen/Dosis">Dosis</a> by Pablo Impallari, <a href="http://www.google.com/fonts/specimen/Signika">Signika</a> by Anna Giedry&#347;, <a href="http://www.google.com/fonts/specimen/Archivo+Narrow">Archivo Narrow</a> by Omnibus-Type, <a href="https://libreplanet.org/wiki/GPG_guide/Graphics_Howto#Pitfalls">PXL-2000</a> by Florian Cramer.
cs: Písma použité v této příručce a informačním letáku: <a href="https://www.google.com/fonts/specimen/Dosis">Dosis</a> by Pablo Impallari, <a href="http://www.google.com/fonts/specimen/Signika">Signika</a> by Anna Giedry&#347;, <a href="http://www.google.com/fonts/specimen/Archivo+Narrow">Archivo Narrow</a> by Omnibus-Type, <a href="https://libreplanet.org/wiki/GPG_guide/Graphics_Howto#Pitfalls">PXL-2000</a> by Florian Cramer.

source: Download the <a href="emailselfdefense_source.zip">source package</a> for this guide, including fonts, image source files and the text of Edward's messages.
cs: Stáhněte si <a href="emailselfdefense_source.zip">balíček se zdrojovým kódem</a> této příručky, s přiloženými písmy, zdrojovými soubory pro obrázky a texty Edwardových zpráv.

source: This site uses the Weblabels standard for labeling <a href="https://www.fsf.org/campaigns/freejs">free JavaScript</a>. View the JavaScript <a href="//weblabels.fsf.org/emailselfdefense.fsf.org/" rel="jslicense">source code and license information</a>.
cs: Tato stránka používá Weblabels standard pro označení <a href="https://www.fsf.org/campaigns/freejs">svobodného JavaScriptu</a>. Prohlédněte si <a href="//weblabels.fsf.org/emailselfdefense.fsf.org/" rel="jslicense">zdrojové kódy a licenční podmínky</a> JavaScriptu.

source: Infographic and guide design by <a rel="external" href="http://jplusplus.org"><strong>Journalism++</strong>
cs: Design informačního letáku a příručky od <a rel="external" href="http://jplusplus.org"><strong>Journalism++</strong>

source: Email Self-Defense
cs: Emailová sebeobrana

source: <a href="https://libreplanet.org/wiki/GPG_guide/Translation_Guide"><strong><span style="color: #2F5FAA;">Translate!</span></strong></a>
cs: <a href="https://libreplanet.org/wiki/GPG_guide/Translation_Guide"><strong><span style="color: #2F5FAA;">Pomozte s překladem ;-)</span></strong></a>

source: <a href="workshops.html">Teach your friends</a>
cs: <a href="workshops.html">Vzdělejte své známé</a>

source: <a href="https://fsf.org/share?u=https://u.fsf.org/zb&amp;t=Email encryption for everyone via %40fsf"> Share&nbsp;
cs: <a href="https://fsf.org/share?u=https://u.fsf.org/zb&amp;t=Email encryption for everyone via %40fsf"> Sdílejte&nbsp;

source: We fight for computer users' rights, and promote the development of free (as in freedom) software. Resisting bulk surveillance is very important to us.
cs: Bojujeme za práva uživatelů a propagujeme rozvoj svobodného software. Ubránit se masovému špehování je pro nás velmi důležité.

source: <strong> Please donate to support Email Self-Defense. We need to keep improving it and making other materials like, for the benefit of people around the world taking the first step towards protecting their privacy. </strong>
cs: <strong> Prosíme přispějte k podpoře emailové sebeobrany. Chtěli bychom ji vylepšit a vytvořit další podobné materiály k prospěchu ostatních lidí kolem světa, kteří začínají bránít své soukromí. </strong>

source: Donate
cs: Přispějte

source: View &amp; share our infographic &rarr;
cs: Prohlédněte si a sdílejte náš informační leták &rarr;

source: </a>Bulk surveillance violates our fundamental rights and makes free speech risky. This guide will teach you a basic surveillance self-defense skill: email encryption. Once you've finished, you'll be able to send and receive emails that are scrambled to make sure a surveillance agent or thief intercepting your email can't read them. All you need is a computer with an Internet connection, an email account, and about forty minutes.
cs: </a>Masové špehování porušuje naše základní práva a ohrožuje svobodu projevu. Tato příručka vás naučí základní dovednosti k sebeobraně proti sledování: šifrování emailové komunikace. Po jejím dokončení budete schopni posílat a přijímat zašifrované emaily, které znemožní čtení vaší komunikace v případě že je zachycena agenty špionážních služeb nebo počítačovými kriminálníky. Vše co k tomu budete potřebovat je počítač s připojením na internet, emailový účet a přibližně čtyřicet minut.

source: Even if you have nothing to hide, using encryption helps protect the privacy of people you communicate with, and makes life difficult for bulk surveillance systems. If you do have something important to hide, you're in good company; these are the same tools that whistleblowers use to protect their identities while shining light on human rights abuses, corruption and other crimes.
cs: I když nemáte co skrývat, použití šifrování chrání soukromí osob, se kterými komunikujete, a znesnadňuje práci systémů masového špehování. Pokud skrýváte cokoli důležitého, nejste sami; popisované nástroje ochránily identitu oznamovatelů, kteří upozornili na porušování lidských práv, úplatky a další trestné činy.

source: In addition to using encryption, standing up to surveillance requires fighting politically for a <a href="http://gnu.org/philosophy/surveillance-vs-democracy.html">reduction in the amount of data collected on us</a>, but the essential first step is to protect yourself and make surveillance of your communication as difficult as possible. This guide helps you do that. It is designed for beginners, but if you already know the basics of GnuPG or are an experienced free software user, you'll enjoy the advanced tips and the <a href="workshops.html">guide to teaching your friends</a>.
cs: Kromě použití šifrování vyžaduje boj proti proti masovému špehování také politický aktivizmus za <a href="http://gnu.org/philosophy/surveillance-vs-democracy.html">snížení množství dat, které je o nás sbíráno</a>, ale ochrana vlastní komunikace proti slídilům je neodmyslitelným prvním krokem. Tato příručka vás naučí, jakým způsobem co nejvíce znesnadnit špehování vaších emailů. Instrukce jsou napsány pro začátečníky, ale pokud máte základní znalosti GnuPG nebo jste zkušený uživatel svobodného software, můžete využít tipy pro pokročilé a <a href="workshops.html">návod, jak naučit základy šifrování své známé.</a>.

source: <em>#1</em> Get the pieces
cs: <em>#1</em> Nainstalujte programy

source: This guide relies on software which is <a href="https://www.gnu.org/philosophy/free-sw.html">freely licensed</a>; it's completely transparent and anyone can copy it or make their own version. This makes it safer from surveillance than proprietary software (like Windows). Learn more about free software at <a href="https://u.fsf.org/ys">fsf.org</a>.
cs: Tato příručka je založena na software, který je poskytován <a href="https://www.gnu.org/philosophy/free-sw.html">pod svobodnou licencí</a>; práce těchto programů je naprosto transparentní a kdokoli může obdržet kopii, nebo vytvořit svou vlastní verzi. Toto zaručuje větší bezpečnost proti špehování než nesvobodný software (jako například Windows). O svobodném software se můžete dozvědět více na stránce <a href="https://u.fsf.org/ys">fsf.org</a>.

source: Most GNU/Linux operating systems come with GnuPG installed on them, so you don't have to download it. Before configuring GnuPG though, you'll need the IceDove desktop email program installed on your computer. Most GNU/Linux distributions have IceDove installed already, though it may be under the alternate name "Thunderbird." Email programs are another way to access the same email accounts you can access in a browser (like Gmail), but provide extra features.
cs: Většina operačních systémů GNU/Linux má GnuPG již připraven k použití, takže jej není potřeba stahovat. Předtím, než nastavíte GnuPG, musíte na váš počítač nainstalovat emailový program IceDove. Většína distribucí GNU/Linux má IceDove již nainstalován, ačkoli může být pod alternativním názvem "Thunderbird." Emailové programy jsou jiný způsob pro přihlášení na stejný emailovému účtu, ke kterému se můžete připojovat přes prohlížeč (např. Gmail), ale poskytují další funkce.

source: If you already have an email program, you can skip to <a href="#step-1b">Step 1.b</a>.
cs: Pokud již emailový program máte, můžete jít rovnou na <a href="#step-1b">Krok 1.b</a>.

source: Step 1.A: Install Wizard
cs: Krok 1.A: Průvodce nastavením

source: <em>Step 1.a</em> Set up your email program with your email account
cs: <em>Krok 1.a</em>Nastavte emailový program pro svůj emailový účet

source: Open your email program and follow the wizard (step-by-step walkthrough) that sets it up with your email account.
cs: Otevřte emailový program a průvodce nastavením vám pomůže (krok za krokem) nastavit program pro váš emailový účet.

source: Look for the letters SSL, TLS, or STARTTLS to the right of the servers when you're setting up your account. If you don't see them, you will still be able to use encryption, but this means that the people running your email system are running behind the industry standard in protecting your security and privacy. We recommend that you send them a friendly email asking them to enable SSL, TLS, or STARTTLS for your email server. They will know what you're talking about, so it's worth making the request even if you aren't an expert on these security systems.
cs: Všimněte si zkratek SSL, TLS, nebo STARTTLS napravo od jmen serverů v nastavení vašeho účtu. Pokud je nevidíte, tak budete pořád schopni používat šifrování, ale znamená to, že poskytovatel vašeho emailového systému je pozadu za průmyslovým standartem určeným k ochraně vaší bezpečnosti a soukromí. Doporučujeme vám, abyste laskavě požádali o spuštění SSL, TLS nebo STARTTLS na vašem emailovém serveru. Lidé zodpovídající za správu vašeho účtu budou vědět o čem je řeč, takže tento požadavek má cenu, i když nejste expert na tyto systémy zabezpečení.

source: Troubleshooting
cs: Řešení problémů

source: The wizard doesn't launch
cs: Průvodce nastavením se nespustil

source: You can launch the wizard yourself, but the menu option for doing so is named differently in each email program. The button to launch it will be in the program's main menu, under "New" or something similar, titled something like "Add account" or "New/Existing email account."
cs: Můžete spustit průvodce sami, ale položka v menu se jmenuje jinak v každém emailovém programu. Tlačítko pro spuštění je v hlavním menu programu, pod položkou "Nový" nebo nějakou podobnou, nazvaný něčím podobným jako "Přidat účet" nebo "Nový/Existující emailový účet."

source: The wizard can't find my account or isn't downloading my mail
cs: Průvodce nastavením nemůže najít můj účet nebo nestahuje můj email

source: Before searching the Web, we recommend you start by asking other people who use your email system, to figure out the correct settings.
cs: Předtím, než začnete vyhledávat na internetu, doporučujeme vám se zeptat na správné nastavení dalších lidí, kteří používají stejný emailový systém.

source: Don't see a solution to your problem?
cs: Nenašli jste řešení vašeho problému?

source: Please let us know on the <a href="https://libreplanet.org/wiki/GPG_guide/Public_Review">feedback page</a>.
cs: Dejte nám vědět na <a href="https://libreplanet.org/wiki/GPG_guide/Public_Review">stránce pro zpětnou vazbu</a>.

source: Step 1.B: Tools -> Add-ons
cs: Krok 1.B: Nástroje -> Doplňky

source: Step 1.B: Search Add-ons
cs: Krok 1.B: Vyhledejte Doplňky

source: Step 1.B: Install Add-ons
cs: Krok 1.B: Nainstalujte Doplňky

source: <em>Step 1.b</em> Install the Enigmail plugin for your email program
cs: <em>Krok 1.b</em>Nainstalujte Enigmail plugin pro svůj emailový program

source: In your email program's menu, select Add-ons (it may be in the Tools section). Make sure Extensions is selected on the left. Do you see Enigmail? If so, skip this step.
cs: V menu vašeho emailového programu, vyberte Add-ons (pravděpodobně se nachází v sekci Nástroje). Ověřte, že nalevo jsou vybrané Extensions.Vidíte Enigmail? Pokud ano, přeskočte tento krok.

source: If not, search "Enigmail" with the search bar in the upper right. You can take it from here. Restart your email program when you're done.
cs: Pokud ne, vyhledejte "Enigmail" v políčku pro vyhledávání vpravo nahoře. Můžete to vzít odsud. Po dokončení restartujte váš emailový program.

source: I can't find the menu.
cs: Nemohu najít menu.

source: In many new email programs, the main menu is represented by an image of three stacked horizontal bars.
cs: V mnoha emailových programech je položka hlavního menu zastoupena obrázkem tří vodorovných čar.

source: My email looks weird
cs: Mé emaily vypadají divně.

source: Enigmail doesn't tend to play nice with HTML, which is used to format emails, so it may disable your HTML formatting automatically. To send an HTML-formatted email without encryption or a signature, hold down the Shift key when you select compose. You can then write an email as if Enigmail wasn't there.
cs: Enigmail běžně nezobrazuje správně HTML, které se používá pro formátování emailů, z toho důvodu je možné, že je HTML formátování automaticky vypnuto. Pro poslání emailu zformátovaného pomocí HTML bez šifrování nebo elektronického podpisu, stiskněte tlačítko Shift při zvolení akce pro napsání nového emailu. Poté můžete napsat email jakobyste Enigmail neměli.

source: <em>#2</em> Make your keys
cs: <em>#2</em> Vytvořte klíče

source: To use the GnuPG system, you'll need a public key and a private key (known together as a keypair). Each is a long string of randomly generated numbers and letters that are unique to you. Your public and private keys are linked together by a special mathematical function.
cs: Pro použití systému GnuPG budete potřebovat veřejný a soukromý klíč (takzvaný klíčový pár). Každý z nich je dlouhý řetězec náhodně vygenerovaných čísel a písmen, které vás jedinečně identifikují. Váš veřejný a soukromý klíč jsou spojeny speciální matematickou funkcí.

source: Your public key isn't like a physical key, because it's stored in the open in an online directory called a keyserver. People download it and use it, along with GnuPG, to encrypt emails they send to you. You can think of the keyserver as a phonebook; people who want to send you encrypted email can look up your public key.
cs: Váš veřejný klíč se liší of skutčného fyzického klíče, protože je uložen ve veřejně přístupné online databázi zvané keyserver. Kdokoli si může stáhnout váš klíč a použít ho společně s GnuPG pro zašifrování emailů, které vám chtějí poslat. Keyserver si můžete představit jako telefoní seznam, ve kterém si lidé, kteří vám chtějí poslat email, najdou váš veřejný klíč.

source: Your private key is more like a physical key, because you keep it to yourself (on your computer). You use GnuPG and your private key together to descramble encrypted emails other people send to you. <span style="font-weight: bold;">You should never share you private key with anyone, under any circumstances.</span>
cs: Váš soukromý klíč je podobný skutečnému klíči, protože si ho musíte schovat pouze pro sebe (na vašem počítači). Pouze vy můžete použít GnuPG dohromady s vašim soukromým klíčem na rozluštění zašifrovaných emailů, které vám ostatní pošlou. <span style="font-weight: bold;">V žádném případě nikdy nesmíte sdílet váš veřejný klíč s nikým dalším.</span>

source: In addition to encryption and decryption, you can also use these keys to sign messages and check the authenticity of other people's signatures. We'll discuss this more in the next section.
cs: Kromě zašifrování a rozšifrování můžete použít tyto klíče pro podpisovíní zpráv a kontrolu autenticity podpisů od ostatních. Více o tomto tématu se dozvíte v další sekci.

source: Step 2.A: Make a Keypair
cs: Krok 2.A: Vytvořte klíčový pár

source: <em>Step 2.a</em> Make a keypair
cs: <em>Krok 2.a</em> Vytvořte klíčový pár

source: The Enigmail Setup wizard may start automatically. If it doesn't, select Enigmail &rarr; Setup Wizard from your email program's menu. You don't need to read the text in the window that pops up unless you'd like to, but it's good to read the text on the later screens of the wizard. Click Next with the default options selected, except in these instances, which are listed in the order they appear:
cs: Průvodcd nastavením Enigmailu se možná spustí automaticky. Pokud ne, vyberte nabídku Enigmail&rarr; Průvodce nastavením z menu vašeho emailového programu. Pokud nechcete, není třeba číst text v okně, které se objeví, ale doporučujeme vám přečíst text na dalších stránkách průvodce. Proklikejte se s použitím tlačítka "Další" s požitím přednastavených možností, kromě následujících případů, které jsou očíslovány ve stejném pořadí jako se objeví:

source: On the screen titled "Encryption," select "Encrypt all of my messages by default, because privacy is critical to me."
cs: Na stránce s titulkem "šifrování," vyberte "Zašifrovat všechny zprávy automaticky, protože soukromí je pro mě kriticky důležité."

source: On the screen titled "Signing," select "Don't sign my messages by default."
cs: Na stránce s titulkem "Popis," select "Nepodepisovat zprávy automaticky."

source: On the screen titled "Key Selection," select "I want to create a new key pair for signing and encrypting my email."
cs: Na stránce s titulkem "Výběr klíče," vyberte "Chtěl bych vytvořit nový pár klíčů pro podpis a šifrování mých emailů."

source: On the screen titled "Create Key," pick a strong password! You can do it manually, or you can use the Diceware method. Doing it manually is faster but not as secure. Using Diceware takes longer and requires dice, but creates a password that is much harder for attackers figure out. To use it, read the section "Make a secure passphrase with Diceware" in <a href="https://theintercept.com/2015/03/26/passphrases-can-memorize-attackers-cant-guess/">this article</a> by Micah Lee.
cs: Na stránce s titulkem "Vytvořit klíč," zvolte silné heslo! Můžete zvolit heslo manuálně, nebo můýete použít Diceware method. Manuální volba je rychlá, ale není tak bezpečná. Použití Diceware trvá déle a vyžaduje hrací kostku, ale vytvořené heslo je mnohem složitější uhádnout případnými útočníky. Pro použití této metody si přečtěte sekci "Vytvořte bezpečné heslo s Diceware" v <a href="https://theintercept.com/2015/03/26/passphrases-can-memorize-attackers-cant-guess/">tomto článku</a> od Micah Lee.

source: If you'd like to pick a password manually, come up with something you can remember which is at least twelve characters long, and includes at least one lower case and upper case letter and at least one number or punctuation symbol. Never pick a password you've used elsewhere. Don't use any recognizable patterns, such as birthdays, telephone numbers, pets' names, song lyrics, quotes from books, and so on.
cs: Pokud chcete vybrat vaše heslo manuálně, vymyslete si něco co si zapamatujete a co má aspoň dvanáct znaků a obsahuje při nejmenším jedno malé písmeno, jedno velké a aspoň jedno číslo nebo symbol. Nikdy nepoužívejte heslo, které jste použili jinde. Nepoužívejte žádné rozpoznatelné vzorce, jako například data narození, telefonní čísla, jména domácích mazlíčků, názvy písní, citáty z knih atd.

source: The program will take a little while to finish the next step, the "Key Creation" screen. While you wait, do something else with your computer, like watching a movie or browsing the Web. The more you use the computer at this point, the faster the key creation will go.
cs: Bude chvíli trvat než program dokončí další krok, kterým je vytvoření klíče. Zatímco čekáte, dělejte něco na svém počítačí, jako například sledování filmu nebo prohlížení internetu. čím více budete při tomto kroku používat počítač, tím rychleji bude klíč vytvořen.
