Repository: tomichec/esd-cs
Catalog: esd-*.po
Languages: cs

source: <span style="font-weight: bold;">When the "Key Generation Completed" screen pops up, select Generate Certificate and choose to save it in a safe place on your computer (we recommend making a folder called "Revocation Certificate" in your home folder and keeping it there). This step is essential for your email self-defense, as you'll learn more about in <a href="#section5">Section 5</a>.</span>
cs: <span style="font-weight: bold;">Až se objeví okno "Vytvoření klíče dokončeno", vyberte Vytvořit certifikát a uložte ho na bezpečné místo ve vašem počítači (doporučujeme vytvořit složku nazvanou "Revokační certifikát" ve vaší domovské složce a ponechat to tam). Tento krok je bezpodmínečně nutný pro vaši emailovou sebeobranu, jak se později dozvíte v <a href="#section5">Sekci 5</a>.</span>

source: I can't find the Enigmail menu.
cs: Nemůžu najít menu pluginu Enigmail.

source: In many new email programs, the main menu is represented by an image of three stacked horizontal bars. Enigmail may be inside a section called Tools.
cs: V mnoha nových emailových programech je hlavní menu reprezentováno obrázkem třech nakupených horizontálních čar. Enigmail možná bude v sekci nazvané Nástroje.

source: The wizard says that it cannot find GnuPG.
cs: Průvodce nastavením hlásí, že nemůže najít GnuPG.

source: Open whatever program you usually use for installing software, and search for GnuPG, then install it. Then restart the Enigmail setup wizard by going to Enigmail &rarr; Setup Wizard.
cs: Otevřete program, který běžně používáte pro instalování software, a vyhledejte a nainstalujte GnuPG. Po dokončení instalace, restartujte Průvodce nastavením pomocí menu Enigmail &rarr; Průvodce nastavením.

source: More resources
cs: Více informací

source: If you're having trouble with our instructions or just want to learn more, check out <a href="https://enigmail.wiki/Key_Management#Generating_your_own_key_pair">Enigmail's wiki instructions for key generation</a>.
cs: Pokud jsou vám naše instrukce nejasné, nebo se chcete dozvědět více, navštivte <a href="https://enigmail.wiki/Key_Management#Generating_your_own_key_pair">Instrukce na wiki pluginu Enigmail pro vytvořeni klíče</a>.

source: Advanced
cs: Pro pokročilé

source: Command line key generation
cs: Vytvoření klíče pomocí příkazové řádky

source: If you prefer using the command line for a higher degree of control, you can follow the documentation from <a href="https://www.gnupg.org/gph/en/manual/c14.html#AEN25">The GNU Privacy Handbook</a>. Make sure you stick with "RSA and RSA" (the default), because it's newer and more secure than the algorithms the documentation recommends. Also make sure your key is at least 2048 bits, or 4096 if you want to be extra secure.
cs: Pokud upřednostňujete použití příkazové řádky pro vyšší míru kontroly, můžete postupovat podle dokumentace v <a href="https://www.gnupg.org/gph/en/manual/c14.html#AEN25">The GNU Privacy Handbook</a>. Ověřte, že jste zvolili "RSA and RSA" (přednastavené volba), protože to je novější a bezpečnější algoritmus, než je doporučen v dokumentaci. Taky ověřte, že váš klíč je alespoň 2048 bitů, nebo 4096 pro ještě vyžší míru zabezpečení.

source: Advanced key pairs
cs: Pokročilé páry klíčů

source: When GnuPG creates a new keypair, it compartmentalizes the encryption function from the signing function through <a href="https://wiki.debian.org/Subkeys">subkeys</a>. If you use subkeys carefully, you can keep your GnuPG identity much more secure and recover from a compromised key much more quickly. <a href="https://alexcabal.com/creating-the-perfect-gpg-keypair/">Alex Cabal</a> and <a href="http://keyring.debian.org/creating-key.html">the Debian wiki</a> provide good guides for setting up a secure subkey configuration.
cs: Když GnuPG vytvoří nový pár klíčů, rozdělí funkci pro šifrování od funkce pro podpis pomocí <a href="https://wiki.debian.org/Subkeys">subkeys (sub-klíčů)</a>. Pokud používáte subkeys, můžete udržet vaší GnuPG identitu mnohem lépe zabezpečenou a rychleji obnovit kompromitované klíče. <a href="https://alexcabal.com/creating-the-perfect-gpg-keypair/">Alex Cabal</a> a <a href="http://keyring.debian.org/creating-key.html">wiki distribuce Debian</a> přinášejí dobré průvodce pro bezpečného nastavení sub-klíčů.

source: <em>Step 2.b</em> Upload your public key to a keyserver
cs: <em>Krok 2.b</em> Nahrajte váš veřejný klíč na keyserver

source: In your email program's menu, select Enigmail &rarr; Key Management.
cs: Ve vašem emailovém programu zvolte Enigmail &rarr; Správa klíčů.

source: Right click on your key and select Upload Public Keys to Keyserver. Use the default keyserver in the popup.
cs: Klikněte pravým tlačítkem na váš klíč a zvolte Nahrát veřejný klíč na Keyserver. V okně, které se objeví, použijte přednastavený keyserver.

source: Now someone who wants to send you an encrypted message can download your public key from the Internet. There are multiple keyservers that you can select from the menu when you upload, but they are all copies of each other, so it doesn't matter which one you use. However, it sometimes takes a few hours for them to match each other when a new key is uploaded.
cs: Nyní si může kdokoli, kdo vám chce poslat zašifrovanou zprávu, stáhnout váš veřejný klíč z internetu. V menu je několik keyserverů, které můžete zvolit když nahraváte klíč, ale všechny jsou navzájem kopírovány, takže je jedno, který z nich se rozhodnete použít. V některých případech ale může trvat i pár hodin, než si servery navzájem předají nově nahraný klíč.

source: The progress bar never finishes
cs: Ukazatel průběhu se neukončí

source: Close the upload popup, make sure you are connected to the Internet, and try again. If that doesn't work, try again, selecting a different keyserver.
cs: Zavřete okno s ukazatelem, ověřte, že jste připojeni k internetu a celý postup opakujte. Pokud se stále klíč nedaří nahrát, vyberte jiný keyserver.

source: My key doesn't appear in the list
cs: Můj klíč se neobjeví v seznamu

source: Try checking "Display All Keys by Default."
cs: Zkuste zvolit "Zobrazit všechny klíče."

source: More documentation
cs: Další dokumentace

source: If you're having trouble with our instructions or just want to learn more, check out <a href="https://www.enigmail.net/documentation/quickstart-ch2.php#id2533620">Enigmail's documentation</a>.
cs: Pokud jsou vám naše instrukce nejasné, nebo se chcete dozvědět více, navštivte <a href="https://www.enigmail.net/documentation/quickstart-ch2.php#id2533620">dokumentaci pluginu Enigmail</a>.

source: Uploading a key from the command line
cs: Nahrání klíče z příkazové řádky

source: You can also upload your keys to a keyserver through the <a href="https://www.gnupg.org/gph/en/manual/x457.html">command line</a>. <a href="https://sks-keyservers.net/overview-of-pools.php">The sks Web site</a> maintains a list of highly interconnected keyservers. You can also <a href="https://www.gnupg.org/gph/en/manual/x56.html#AEN64">directly export your key</a> as a file on your computer.
cs: Také můžete nahrát váš klíč na keyserver pomocí <a href="https://www.gnupg.org/gph/en/manual/x457.html">příkazové řádky</a>. <a href="https://sks-keyservers.net/overview-of-pools.php">Stránky sks</a> obsahují seznam dobře propojených keyserverů. Můžete také <a href="https://www.gnupg.org/gph/en/manual/x56.html#AEN64">exportovat váš klíč </a> na váš počítač jako soubor.

source: GnuPG, OpenPGP, what?
cs: Jaký je rozdíl mezi GnuPG a OpenPGP?

source: In general, the terms GnuPG, GPG, GNU Privacy Guard, OpenPGP and PGP are used interchangeably. Technically, OpenPGP (Pretty Good Privacy) is the encryption standard, and GNU Privacy Guard (often shortened to GPG or GnuPG) is the program that implements the standard. Enigmail is a plug-in program for your email program that provides an interface for GnuPG.
cs: Obecně jsou pojmy GnuPG, GPG a GNU Privacy Guard, OpenGPG a PGP zaměnitelné. Z technického hlediska je OpenGPG (Pretty Good Privacy) je šifrovací standart, a GNU Privacy Guard (často jako zkracován jako GPG or GnuPG) je program, který implementuje tento šifrovací standart. Enigmail je plugin pro váš email, který poskytuje rozhraní pro GnuPG.

source: <em>#3</em> Try it out!
cs: <em>#3</em> Vyzkoušejte to!

source: Now you'll try a test correspondence with a computer program named Edward, who knows how to use encryption. Except where noted, these are the same steps you'd follow when corresponding with a real, live person.
cs: Nyní můžete vyskoušet korespondenci s počítačovým programem Edwardem, který ví, jak používat šifrování. Pokud není řečeno jinak, je tento postup stejný, jakokdyby jste si dopisovali se skutečnou osobou.

source: <em>Step 3.a</em> Send Edward your public key
cs: <em>Krok 3.a</em> Pošlete Edwardovi váš veřejný klíč

source: This is a special step that you won't have to do when corresponding with real people. In your email program's menu, go to Enigmail &rarr; Key Management. You should see your key in the list that pops up. Right click on your key and select Send Public Keys by Email. This will create a new draft message, as if you had just hit the Write button.
cs: Tento krok nebudete potřebovat při dopisování se skutečnou osobou. V menu svého emailovém programu, jděte do Enigmail &rarr; Správa klíčů. Mělibyste vidět váš klíč v listě který se objeví. Klikněte pravým tlačítkem na váš klíč a vyberte Poslat veřejný klíč emailem. Toto otevře novou zprávu, jakobyste klikli na tlačítko napsat zprávu.

source: Address the message to <a href="mailto:edward-en@fsf.org">edward-en@fsf.org</a>. Put at least one word (whatever you want) in the subject and body of the email. Don't send yet.
cs: Adresujte zprávu na <a href="mailto:edward-en@fsf.org">edward-en@fsf.org</a>. Napište alespoň jedno slovo do předmětu zprávy a samotného emailu (může to být cokoli). Zatím neodesílejte.

source: The lock icon in the top left should be yellow, meaning encryption is turned on. We want this first special message to be unencrypted, so click the icon once to turn it off. The lock should become grey, with a blue dot on it (to alert you that the setting has been changed from the default). Once encryption is off, hit Send.
cs: Ikona zámku na vlevo nahoře by měla být zvýrazněna žlutě, což znamená, že šifrování je zapnuto. Tato první zpráva by měla být nezašifrovaná, což zařídíte tak, že jednou kliknete na ikonu, což šifrování vypne. Ikona zámku se zároveň vybarví šedě s modrou tečkou (čímž vás upozorňuje, že toto nastavení bylo změněno oproti základnímu nastavení). Pokud je šifrování vypnuto, zprávu odešlete.

source: It may take two or three minutes for Edward to respond. In the meantime, you might want to skip ahead and check out the <a href="#section5">Use it Well</a> section of this guide. Once he's responded, head to the next step. From here on, you'll be doing just the same thing as when corresponding with a real person.
cs: Edwardovi to může trvat dvě až tři minuty, než vám odepíše. Zatím, si můžete přečíst sekci <a href="#section5"> o správném použití</a> v této příručce. Až Edward odepíše, pokračujte na další krok. Další kroky jsou stejné při dopisování si se skutečnou osobou.

source: When you open Edward's reply, GnuPG may prompt you for your password before using your private key to decrypt it.
cs: Když otevřete Edwardovu odpověď, GnuPG se zeptá na heslo před použitím vašeho soukromého klíče pro dešifrování.

source: <em>Step 3.b</em> Send a test encrypted email
cs: <em>Krok 3.b</em> Pošlete testovací šifrovaný email

source: Write a new email in your email program, addressed to <a href="mailto:edward-en@fsf.org">edward-en@fsf.org</a>. Make the subject "Encryption test" or something similar and write something in the body.
cs: Napište email ve vašem emailovém programu, adresovaný <a href="mailto:edward-en@fsf.org">edward-en@fsf.org</a>. Do předmětu emailu napište "Zkouška šifrování" nebo něco podobného a napište něco do obsahu emailu.

source: The lock icon in the top left of the window should be yellow, meaning encryption is on. This will be your default from now on.
cs: Ikona zámku vlevo nahoře v okně by měla být žlutá, což znamená, že šifrování je zapnuté. Toto bude od nynejška základní nastavení.

source: Next to the lock, you'll notice an icon of a pencil. We'll get to this in a moment.
cs: Vedle zámku můžete vidět ikonu pera. O této funkci se více dozvíte za chvíli.

source: Click Send. Enigmail will pop up a window that says "Recipients not valid, not trusted or not found."
cs: Klikněte na Odeslat. Enigmail otevře okno s nápisem "Příjemci nejsou ověřeni, důvěřování nebo nalezeni."

source: To encrypt an email to Edward, you need his public key, so now you'll have Enigmail download it from a keyserver. Click Download Missing Keys and use the default in the pop-up that asks you to choose a keyserver. Once it finds keys, check the first one (Key ID starting with C), then select ok. Select ok in the next pop-up.
cs: Abyste zašifrovali email pro Edwarda, budete potřebovat jeho veřejný klíč, takže můžete Enigmail nechat jeho klíč stáhnout z keyserveru. Klikněte na Stáhnout chybějící klíče a použijte základní nastavení v okně, které se objeví a zeptá na vaši volbu keyserveru. Poté co budou klíče nalezeny, zaškrkněte první z nich (ID klíče začíná písmenem C), a poté zvolte OK. Zvolte OK také v dalším okně, které se objeví.

source: Now you are back at the "Recipients not valid, not trusted or not found" screen. Check the box in front of Edward's key and click Send.
cs: Nyní jste zpět na obrazovce "Příjemci nejsou nejsou ověřeni, důvěřování nebo nalezeni". Vyberte pole před Edwardovým klíčem a klikněte na Odeslat.

source: Since you encrypted this email with Edward's public key, Edward's private key is required to decrypt it. Edward is the only one with his private key, so no one except him can decrypt it.
cs: Protože jste zašifrovali tento email s Edwardovým veřejným klíčem, pro dešifrování je potřeba Edwardova soukromého klíče. Edward je jediný, kdo má tento soukromý klíč, takže kromě něj nemůže nikdo další zprávu dešifrovat.

source: Enigmail can't find Edward's key
cs: Enigmail nemůže nalézt Edwardův klíč

source: Close the pop-ups that have appeared since you clicked Send. Make sure you are connected to the Internet and try again. If that doesn't work, repeat the process, choosing a different keyserver when it asks you to pick one.
cs: Zavřete okna, která se objevily poté co jste klikli na Odeslat. Zkontrolujte, že jste připojeni na internet a zkuste to znova. Pokud to stále nefunguje, zopakujte celý postup a až budete vyzvání k výběru keyserveru, vyberte jiný než minule.

source: Unscrambled messages in the Sent folder
cs: Nezašifrované zprávy ve složce Odeslané

source: Even though you can't decrypt messages encrypted to someone else's key, your email program will automatically save a copy encrypted to your public key, which you'll be able to view from the Sent folder like a normal email. This is normal, and it doesn't mean that your email was not sent encrypted.
cs: I když nemůžete dešifrovat zprávy zašifrované klíčem někoho jiného, váš emailový program automaticky uloží kopiji zašifrovanou vašim veřejným klíčem, kterou budete moci otevřít ve složce Odeslané jako běžný email. Toto je normální a neznamená to, že vaše zpráva nebyla odeslaná nezašifrovaně.

source: If you're still having trouble with our instructions or just want to learn more, check out <a href="https://enigmail.wiki/Signature_and_Encryption#Encrypting_a_message">Enigmail's wiki</a>.
cs: Pokud máte další nejasnosti s našimi instrukcemi, nebo se chcete dozvědět více navštivte <a href="https://enigmail.wiki/Signature_and_Encryption#Encrypting_a_message">Enigmail's wiki</a>.

source: Encrypt messages from the command line
cs: Šifrování zpráv z příkazové řádky

source: You can also encrypt and decrypt messages and files from the <a href="https://www.gnupg.org/gph/en/manual/x110.html">command line</a>, if that's your preference. The option --armor makes the encrypted output appear in the regular character set.
cs: Také můžete šifrovat zprávy z <a href="https://www.gnupg.org/gph/en/manual/x110.html">příkazové řádky</a>, pokud to upřednostňujete. Možnost --armor zaručí, že zpráva se objeví v standartní saďe znaků.

source: <em>Important:</em> Security tips
cs: <em>Důležité:</em> Bezpčnostní tipy

source: Even if you encrypt your email, the subject line is not encrypted, so don't put private information there. The sending and receiving addresses aren't encrypted either, so a surveillance system can still figure out who you're communicating with. Also, surveillance agents will know that you're using GnuPG, even if they can't figure out what you're saying. When you send attachments, Enigmail will give you the choice to encrypt them or not, independent of the actual email.
cs: I přesto, že jste zašifrovali obsah vašeho emailu, jeho předmět zašifrovaný není, takže v předmětu nezmiňujte žádné citlivé informace. Rovněž adresy odesílatele a příjemců nejsou zašifrované, takže špionážní systémy mohou stále zjistit s kým komunikujete. Agentům špionážních služeb bude také zřejmé, že používáte GnuGP, i když obsah vašich zpráv nezjistí.

source: <em>Step 3.c</em> Receive a response
cs: <em>Step 3.c</em> Obdržte odpověď

source: When Edward receives your email, he will use his private key to decrypt it, then use your public key (which you sent him in <a href="#step-3a">Step 3.A</a>) to encrypt his reply to you.
cs: Když Edward dostane váš email, použije svůj soukromý klíč pro jeho dešifrování, poté použije váš veřejný klíč (který jste mu poslali v <a href="#step-3a">Kroku 3.A</a>), aby zašifroval svou odpověď pro vás.

source: It may take two or three minutes for Edward to respond. In the meantime, you might want to skip ahead and check out the <a href="#section5">Use it Well</a> section of this guide.
cs: Edwardovi to může trvat pár minut, než vám odepíše. Během čekání na odpověď, si můžete přečíst sekci <a href="#section5">Správné použití</a> v této příručce.

source: When you receive Edward's email and open it, Enigmail will automatically detect that it is encrypted with your public key, and then it will use your private key to decrypt it.
cs: Když obdržíte Edwardův email a otevřete ho, Enigmail automaticky zjistí, že je šifrovaný vašim veřejným klíčem, a použije váš soukromý klíč aby ho dešifroval.

source: Notice the bar that Enigmail shows you above the message, with information about the status of Edward's key.
cs: Všiměte si lišty s informacemi o stavu Edwardova klíče, kterou Enigmail zobrazí nad vaši zprávou.

source: <em>Step 3.d</em> Send a test signed email
cs: <em>Krok 3.d</em> Pošlete testovací podepsaný email

source: GnuPG includes a way for you to sign messages and files, verifying that they came from you and that they weren't tampered with along the way. These signatures are stronger than their pen-and-paper cousins -- they're impossible to forge, because they're impossible to create without your private key (another reason to keep your private key safe).
cs: GnuPG umožňuje elektronické podepsání vaší zprávy a souborů, pro ověření, že přicházejí od vás a že s nimi nebylo manipulováno během přenosu. Elektronický podpis je spolehlivější než tradiční podpis perem na papíře -- je nemožné ho padělat, protože jej není možné vytvořit bez vašeho soukromého klíče (což je další důvod pro bezpečné uložení vašeho klíče).

source: You can sign messages to anyone, so it's a great way to make people aware that you use GnuPG and that they can communicate with you securely. If they don't have GnuPG, they will be able to read your message and see your signature. If they do have GnuPG, they'll also be able to verify that your signature is authentic.
cs: Můžete podepsat zprávu pro kohokoli, což to je skvělý způsob, jak ostatním ukázat, že používáte GnuPG a že s vámi mohou komunikovat zabezpečeně. Pokud příjemce nemá GnuPG, může si přečíst vaše zprávy a uvidí váš podpis. Pokud GnuPG má, může rovněž ověřit pravost vašeho podpisu.

source: To sign an email to Edward, compose any message to him and click the pencil icon next to the lock icon so that it turns gold. If you sign a message, GnuPG may ask you for your password before it sends the message, because it needs to unlock your private key for signing.
cs: Pro podepsání emailu Edwardovi, mu napište jakoukoli zprávu a klikněte na ikonu pera hned vedle ikony zámku, tak, aby se zbarvila do zlata. Pokud zprávu podepíšete, GnuPG se vás zeptá před jejím odesláním na vaše heslo, protože pro vytvoření podpisu je třeba odemknout váš soukromý klíč.

source: With the lock and pencil icons, you can choose whether each message will be encrypted, signed, both, or neither.
cs: S ikonami zámku a pera, můžete vybrat, jestli bude vaše zpráva zašifrovaná, podepsaná, obojí, nebo ani jedno.

source: <em>Step 3.e</em> Receive a response
cs: <em>Krok 3.e</em> Obdržte odpověď

source: When Edward receives your email, he will use your public key (which you sent him in <a href="#step-3a">Step 3.A</a>) to verify that your signature is authentic and the message you sent has not been tampered with.
cs: Když Edward dostane vaši zprávu, použije váš veřejný klíč (jenž jste mu poslali v <a href="#step-3a">Kroku 3.A</a>), aby ověřil, že váš podpis je autentický a že s vaší zprávou nebylo manipulováno.

source: Edward's reply will arrive encrypted, because he prefers to use encryption whenever possible. If everything goes according to plan, it should say "Your signature was verified." If your test signed email was also encrypted, he will mention that first.
cs: Edwardovy odpovědi dojdou zašifrované, protože Edward upřednostňuje šifrování kdy je to jen možné. Pokud jde vše podle plánu, měl by říct "Váš podpis byl ověřen." Pokud váš testovací email s podpisem byl rovněž podepsán, zmíní tuto informaci jako první.

source: <em>#4</em> Learn the Web of Trust
cs: <em>#4</em> Síť důvěry

source: Email encryption is a powerful technology, but it has a weakness; it requires a way to verify that a person's public key is actually theirs. Otherwise, there would be no way to stop an attacker from making an email address with your friend's name, creating keys to go with it and impersonating your friend. That's why the free software programmers that developed email encryption created keysigning and the Web of Trust.
cs: Šifrování emailu je silná technologie, ale má slabou stránku; vyžaduje způsob jak ověřit, že veřejný klíč je skutečně od té pravé osoby. Jinak by nebylo možné zabránit, aby útočník vydávajícího se za vašeho přítele vytvořil emailovou adresu a klíče pod jeho jménem. Z tohoto důvodu programátoři, kteří vytvořili emailové šifrování rovněž vytvořili podpisování klíču a Síť důvěry.

source: When you sign someone's key, you are publicly saying that you've verified that it belongs to them and not someone else.
cs: Když podepíšete něčí klíč, veřejně oznamujete, že jste ověřili, že skutečně patří této osobě a ne nikomu jinému.

source: Signing keys and signing messages use the same type of mathematical operation, but they carry very different implications. It's a good practice to generally sign your email, but if you casually sign people's keys, you may accidently end up vouching for the identity of an imposter.
cs: Podpisování klíčů a podpisování zpráv používá stejnou matematickou operaci, ale každý z těchto podpisů má jiné důsledky. Je v pořádku podepsat každý váš email, ale pokud podepíšete klíč jiné osoby, aniž byste ověřili její identitu, můžete se omylem zaručit za podvodníka.
